[Killed] BooleanLiteral
src/server/NimGame.ts:11:40
     private _pile: number;
     private _limit: number;
     
-    private _gameInProgress: boolean = false;
+    private _gameInProgress: boolean = true;
     private _gameOver: boolean = false;
 
killedBy: NimGame should throw an error if the number of sticks to take is invalid
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Game not in progress"
Received message:   "Invalid number of sticks: 0"

      180 |         } else {
      181 |           stryCov_9fa48("41");
    > 182 |           throw new Error(stryMutAct_9fa48("42") ? `` : (stryCov_9fa48("42"), `Invalid number of sticks: ${numSticks}`));

[Killed] BooleanLiteral
src/server/NimGame.ts:12:34
     private _limit: number;
     
     private _gameInProgress: boolean = false;
-    private _gameOver: boolean = false;
+    private _gameOver: boolean = true;
 
     // the PlayerList maintains the list of players and the current player
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Game is over

[Killed] BlockStatement
src/server/NimGame.ts:22:54
      * Creates a new instance of the Nim class.
      * @param initPile The initial number of sticks in the pile.
      */
-    constructor(initPile: number, turnLimit: number) {
-        this._pile = initPile;
-        this._limit = turnLimit;
-        this._players = new PlayerList();        
-    }
+    constructor(initPile: number, turnLimit: number) {}
 
     /** add a player */
killedBy: NimGame should initialize a new game with the correct pile and limit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] BlockStatement
src/server/NimGame.ts:29:45
     }
 
     /** add a player */
-    public addPlayer(player: IPlayer): void {
-        this._players.addPlayer(player);
-        // if this is the first player added, make them the first player to play
-        // .addPlayer() sets the first player to be the current player
-        // if there are two players, start the game
-        if (this._players.nPlayers >= 2) {       
-            this._gameInProgress = true;
-        }
-    }
+    public addPlayer(player: IPlayer): void {}
 
     /** get the players */
killedBy: NimGame should add a player to the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/server/NimGame.ts:34:13
         // if this is the first player added, make them the first player to play
         // .addPlayer() sets the first player to be the current player
         // if there are two players, start the game
-        if (this._players.nPlayers >= 2) {       
+        if (this._players.nPlayers > 2) {       
             this._gameInProgress = true;
         }
killedBy: NimGame should throw an error if the number of sticks to take is invalid
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid number of sticks"
Received message:   "Game not in progress"

      156 |         } else {
      157 |           stryCov_9fa48("21");
    > 158 |           throw new Error(stryMutAct_9fa48("22") ? "" : (stryCov_9fa48("22"), "Game not in progress"));

[Killed] ConditionalExpression
src/server/NimGame.ts:34:13
         // if this is the first player added, make them the first player to play
         // .addPlayer() sets the first player to be the current player
         // if there are two players, start the game
-        if (this._players.nPlayers >= 2) {       
+        if (false) {       
             this._gameInProgress = true;
         }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Game not in progress

[Killed] BooleanLiteral
src/server/NimGame.ts:35:36
         // .addPlayer() sets the first player to be the current player
         // if there are two players, start the game
         if (this._players.nPlayers >= 2) {       
-            this._gameInProgress = true;
+            this._gameInProgress = false;
         }
     }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Game not in progress

[Killed] BlockStatement
src/server/NimGame.ts:40:37
     }
 
     /** get the players */
-    public getPlayers(): PlayerList {
-        return this._players;
-    }
+    public getPlayers(): PlayerList {}
 
     public getCurrentPlayer(): IPlayer | undefined {   
killedBy: NimGame should add a player to the game
statusReason: TypeError: Cannot read properties of undefined (reading 'playerList')

[Killed] BlockStatement
src/server/NimGame.ts:44:52
         return this._players;
     }
 
-    public getCurrentPlayer(): IPlayer | undefined {   
-        return this._players.currentPlayer;
-    }
+    public getCurrentPlayer(): IPlayer | undefined {}
     /**
      * Gets the current number of sticks in the pile.
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"name": "Alice"}
Received: undefined

[Killed] BlockStatement
src/server/NimGame.ts:51:30
      * Gets the current number of sticks in the pile.
      * @returns The current number of sticks in the pile.
      */
-    public getPile(): number {
-        return this._pile;
-    }
+    public getPile(): number {}
 
     /**
killedBy: NimGame should initialize a new game with the correct pile and limit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] BlockStatement
src/server/NimGame.ts:59:34
      * Determines if the game is over.
      * @returns True if the game is over (i.e. the pile is empty), false otherwise.
      */
-    public isGameOver(): boolean {
-        return this._pile === 0;
-    }   
+    public isGameOver(): boolean {}   
     
     /**
killedBy: NimGame should initialize a new game with the correct pile and limit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/server/NimGame.ts:60:16
      * @returns True if the game is over (i.e. the pile is empty), false otherwise.
      */
     public isGameOver(): boolean {
-        return this._pile === 0;
+        return false;
     }   
     
killedBy: NimGame should end the game when the pile is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/server/NimGame.ts:60:16
      * @returns True if the game is over (i.e. the pile is empty), false otherwise.
      */
     public isGameOver(): boolean {
-        return this._pile === 0;
+        return true;
     }   
     
killedBy: NimGame should initialize a new game with the correct pile and limit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/server/NimGame.ts:69:65
      * @throws An error if the number of sticks to take is invalid (i.e. less than 1 or greater than the number of sticks in the pile).
      * if the number of sticks is valid, advances the turn to the next player
     */
-    public takeSticks(player: IPlayer, numSticks: number): void {
-        if (!this._gameInProgress) {
-            throw new Error("Game not in progress");
-        }
-        if (this._gameOver) {
-            throw new Error("Game is over");
-        }
-        if (player !== this._players.currentPlayer) {
-            throw new Error("Not this player's turn");
-        }
-        if (numSticks < 1 || numSticks > this._limit) {
-            throw new Error(`Invalid number of sticks: ${numSticks}`);
-        }
-        // take the sticks and advance to the next player
-        this._pile -= numSticks;
-        this._players.nextPlayer();
-    }
+    public takeSticks(player: IPlayer, numSticks: number): void {}
 }
 
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 10

[Killed] ConditionalExpression
src/server/NimGame.ts:70:13
      * if the number of sticks is valid, advances the turn to the next player
     */
     public takeSticks(player: IPlayer, numSticks: number): void {
-        if (!this._gameInProgress) {
+        if (true) {
             throw new Error("Game not in progress");
         }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Game not in progress

[Killed] ConditionalExpression
src/server/NimGame.ts:70:13
      * if the number of sticks is valid, advances the turn to the next player
     */
     public takeSticks(player: IPlayer, numSticks: number): void {
-        if (!this._gameInProgress) {
+        if (false) {
             throw new Error("Game not in progress");
         }
killedBy: NimGame should throw an error if the number of sticks to take is invalid
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Game not in progress"
Received message:   "Invalid number of sticks: 0"

      180 |         } else {
      181 |           stryCov_9fa48("41");
    > 182 |           throw new Error(stryMutAct_9fa48("42") ? `` : (stryCov_9fa48("42"), `Invalid number of sticks: ${numSticks}`));

[Killed] ConditionalExpression
src/server/NimGame.ts:73:13
         if (!this._gameInProgress) {
             throw new Error("Game not in progress");
         }
-        if (this._gameOver) {
+        if (true) {
             throw new Error("Game is over");
         }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Game is over

[NoCoverage] BlockStatement
src/server/NimGame.ts:73:29
         if (!this._gameInProgress) {
             throw new Error("Game not in progress");
         }
-        if (this._gameOver) {
-            throw new Error("Game is over");
-        }
+        if (this._gameOver) {}
         if (player !== this._players.currentPlayer) {
             throw new Error("Not this player's turn");

[NoCoverage] StringLiteral
src/server/NimGame.ts:74:29
             throw new Error("Game not in progress");
         }
         if (this._gameOver) {
-            throw new Error("Game is over");
+            throw new Error("");
         }
         if (player !== this._players.currentPlayer) {

[Killed] ConditionalExpression
src/server/NimGame.ts:76:13
         if (this._gameOver) {
             throw new Error("Game is over");
         }
-        if (player !== this._players.currentPlayer) {
+        if (true) {
             throw new Error("Not this player's turn");
         }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Not this player's turn

[Killed] EqualityOperator
src/server/NimGame.ts:76:13
         if (this._gameOver) {
             throw new Error("Game is over");
         }
-        if (player !== this._players.currentPlayer) {
+        if (player === this._players.currentPlayer) {
             throw new Error("Not this player's turn");
         }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Not this player's turn

[Killed] EqualityOperator
src/server/NimGame.ts:79:13
         if (player !== this._players.currentPlayer) {
             throw new Error("Not this player's turn");
         }
-        if (numSticks < 1 || numSticks > this._limit) {
+        if (numSticks <= 1 || numSticks > this._limit) {
             throw new Error(`Invalid number of sticks: ${numSticks}`);
         }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Invalid number of sticks: 1

[Killed] EqualityOperator
src/server/NimGame.ts:79:30
         if (player !== this._players.currentPlayer) {
             throw new Error("Not this player's turn");
         }
-        if (numSticks < 1 || numSticks > this._limit) {
+        if (numSticks < 1 || numSticks >= this._limit) {
             throw new Error(`Invalid number of sticks: ${numSticks}`);
         }
killedBy: NimGame should end the game when the pile is empty
statusReason: Error: Invalid number of sticks: 3

[Killed] StringLiteral
src/server/NimGame.ts:80:29
             throw new Error("Not this player's turn");
         }
         if (numSticks < 1 || numSticks > this._limit) {
-            throw new Error(`Invalid number of sticks: ${numSticks}`);
+            throw new Error(``);
         }
         // take the sticks and advance to the next player
killedBy: NimGame should throw an error if the number of sticks to take is invalid
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid number of sticks"
Received message:   ""

      180 |         } else {
      181 |           stryCov_9fa48("41");
    > 182 |           throw new Error(stryMutAct_9fa48("42") ? `` : (stryCov_9fa48("42"), `Invalid number of sticks: ${numSticks}`));

[Killed] AssignmentOperator
src/server/NimGame.ts:83:9
             throw new Error(`Invalid number of sticks: ${numSticks}`);
         }
         // take the sticks and advance to the next player
-        this._pile -= numSticks;
+        this._pile += numSticks;
         this._players.nextPlayer();
     }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 14
