[Killed] BlockStatement
src/server/PlayerList.ts:9:19
     private _currentIndex: number | undefined;
 
 
-    constructor() {
-        this._players = [];
-    }
+    constructor() {}
 
     /** add a player to the list */
killedBy: NimGame should add a player to the game
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
src/server/PlayerList.ts:10:25
 
 
     constructor() {
-        this._players = [];
+        this._players = ["Stryker was here"];
     }
 
killedBy: NimGame should add a player to the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
src/server/PlayerList.ts:15:39
 
     /** add a player to the list */
     /** make the first player added the initial current player */
-    public addPlayer(player: IPlayer) {
-        this._players.push(player);
-        if (this._players.length === 1) {
-            this._currentIndex = 0;
-        }
-    }
+    public addPlayer(player: IPlayer) {}
 
     public get nPlayers() { return this._players.length; }
killedBy: NimGame should add a player to the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/server/PlayerList.ts:17:41
     /** make the first player added the initial current player */
     public addPlayer(player: IPlayer) {
         this._players.push(player);
-        if (this._players.length === 1) {
-            this._currentIndex = 0;
-        }
+        if (this._players.length === 1) {}
     }
 
killedBy: NimGame should add a player to the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"name": "Alice"}
Received: undefined

[Killed] EqualityOperator
src/server/PlayerList.ts:17:13
     /** make the first player added the initial current player */
     public addPlayer(player: IPlayer) {
         this._players.push(player);
-        if (this._players.length === 1) {
+        if (this._players.length !== 1) {
             this._currentIndex = 0;
         }
killedBy: NimGame should add a player to the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"name": "Alice"}
Received: undefined

[Killed] BlockStatement
src/server/PlayerList.ts:22:27
         }
     }
 
-    public get nPlayers() { return this._players.length; }
+    public get nPlayers() {}
     public get playerList() { return this._players; }
     
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Game not in progress

[Killed] BlockStatement
src/server/PlayerList.ts:23:29
     }
 
     public get nPlayers() { return this._players.length; }
-    public get playerList() { return this._players; }
+    public get playerList() {}
     
 
killedBy: NimGame should add a player to the game
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/server/PlayerList.ts:27:51
     
 
     // index of the current player
-    public get currentIndex(): number | undefined { 
-        return this._currentIndex; 
-    }
+    public get currentIndex(): number | undefined {}
 
     // the current player
killedBy: PlayerList should make the first player added the initial current player
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/server/PlayerList.ts:32:53
     }
 
     // the current player
-    public get currentPlayer(): IPlayer | undefined {
-        return this._currentIndex !== undefined? this._players[this._currentIndex] : undefined;
-    }
+    public get currentPlayer(): IPlayer | undefined {}
     
 
killedBy: NimGame should add a player to the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"name": "Alice"}
Received: undefined

[Killed] ConditionalExpression
src/server/PlayerList.ts:33:16
 
     // the current player
     public get currentPlayer(): IPlayer | undefined {
-        return this._currentIndex !== undefined? this._players[this._currentIndex] : undefined;
+        return false? this._players[this._currentIndex] : undefined;
     }
     
killedBy: NimGame should add a player to the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"name": "Alice"}
Received: undefined

[Killed] EqualityOperator
src/server/PlayerList.ts:33:16
 
     // the current player
     public get currentPlayer(): IPlayer | undefined {
-        return this._currentIndex !== undefined? this._players[this._currentIndex] : undefined;
+        return this._currentIndex === undefined? this._players[this._currentIndex] : undefined;
     }
     
killedBy: NimGame should add a player to the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"name": "Alice"}
Received: undefined

[Killed] BlockStatement
src/server/PlayerList.ts:38:31
     
 
     /** advances the current player to the next player in the list */
-    public nextPlayer(): void {
-        if (this._currentIndex !== undefined) {
-            this._currentIndex = (this._currentIndex + 1) % this.nPlayers;
-        }
-    
-    }
+    public nextPlayer(): void {}
 
 }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Not this player's turn

[Killed] BlockStatement
src/server/PlayerList.ts:39:47
 
     /** advances the current player to the next player in the list */
     public nextPlayer(): void {
-        if (this._currentIndex !== undefined) {
-            this._currentIndex = (this._currentIndex + 1) % this.nPlayers;
-        }
+        if (this._currentIndex !== undefined) {}
     
     }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Not this player's turn

[Killed] EqualityOperator
src/server/PlayerList.ts:39:13
 
     /** advances the current player to the next player in the list */
     public nextPlayer(): void {
-        if (this._currentIndex !== undefined) {
+        if (this._currentIndex === undefined) {
             this._currentIndex = (this._currentIndex + 1) % this.nPlayers;
         }
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Not this player's turn

[Killed] ArithmeticOperator
src/server/PlayerList.ts:40:35
     /** advances the current player to the next player in the list */
     public nextPlayer(): void {
         if (this._currentIndex !== undefined) {
-            this._currentIndex = (this._currentIndex + 1) % this.nPlayers;
+            this._currentIndex = (this._currentIndex - 1) % this.nPlayers;
         }
     
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Not this player's turn

[Killed] ArithmeticOperator
src/server/PlayerList.ts:40:34
     /** advances the current player to the next player in the list */
     public nextPlayer(): void {
         if (this._currentIndex !== undefined) {
-            this._currentIndex = (this._currentIndex + 1) % this.nPlayers;
+            this._currentIndex = (this._currentIndex + 1) * this.nPlayers;
         }
     
killedBy: NimGame should switch to the next player after taking sticks
statusReason: Error: Not this player's turn
